IDEA Open Model
ConcreteSLSCheckResultCrackWidthEc2 Class
Compatible with IDEA StatiCa 20.1
 SLS Check Crack width Ec2
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultCrackWidth
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultCrackWidthEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConcreteSLSCheckResultCrackWidthEc2 : ConcreteSLSCheckResultCrackWidth
Public Class ConcreteSLSCheckResultCrackWidthEc2
	Inherits ConcreteSLSCheckResultCrackWidth
The ConcreteSLSCheckResultCrackWidthEc2 type exposes the following members.
Constructors
Name | Description
ConcreteSLSCheckResultCrackWidthEc2
Initializes a new instance of the ConcreteSLSCheckResultCrackWidthEc2 class
Top
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
My
 Bending moment around y axis for quasi-permanent combination
Mz
 Bending moment around z axis for quasi-permanent combination
N
 Normal force for quasi-permanent combination
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
W
 calculated crack width value
Wlim
 limiting crack width value
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace